### Reading the csv file

In [ ]:
import pandas as pd    # dataframe operations 
import numpy as np      # math operations
import matplotlib.pyplot as plt    # diagrams /plots 
import seaborn as sns     # diagram

In [7]:
# path 
path=r"C:\Users\rakes\Visadataset - Visadataset.csv"

In [10]:
import pandas as pd 

path=r"C:\Users\rakes\Visadataset - Visadataset.csv"
pd.read_csv(path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [12]:
import pandas as pd 
path=r"C:\Users\rakes\EDA\bank - bank.csv"
pd.read_csv(path,
            sep=';')

     age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0     30,unemployed,married,primary,no,1787,no,no,ce...
1     33,services,married,secondary,no,4789,yes,yes,...
2     35,management,single,tertiary,no,1350,yes,no,c...
3     30,management,married,tertiary,no,1476,yes,yes...
4     59,blue-collar,married,secondary,no,0,yes,no,u...
...                                                 ...
4516  33,services,married,secondary,no,-333,yes,no,c...
4517  57,self-employed,married,tertiary,yes,-3313,ye...
4518  57,technician,married,secondary,no,295,no,no,c...
4519  28,blue-collar,married,secondary,no,1137,no,no...
4520  44,entrepreneur,single,tertiary,no,1136,yes,ye...

[4521 rows x 1 columns]

### create dataframes using list

In [13]:
name=['ramesh', 'suresh','satish']
age=[30,40,50]
name ,age

(['ramesh', 'suresh', 'satish'], [30, 40, 50])

###  create the data frame

In [ ]:
pd.DataFrame   #make the data frame

### provide data

In [15]:
pd.DataFrame(zip(name,age))

        0   1
0  ramesh  30
1  suresh  40
2  satish  50

In [17]:
# provide coloumns 
data=zip(name,age)
cols=['name','age']

pd.DataFrame(data,columns=cols)

     name  age
0  ramesh   30
1  suresh   40
2  satish   50

###  step-4 provide index

In [18]:
data=zip(name,age)
cols=['name','age']
ind=['a','b','c']
pd.DataFrame(data,columns=cols, index=ind)

     name  age
a  ramesh   30
b  suresh   40
c  satish   50

### step-5 add new column

In [20]:
name=['ramesh', 'suresh','satish']
age=[30,40,50]

data=zip(name,age)
cols=['name','age']
ind=['a','b','c']
df=pd.DataFrame(data,columns=cols, index=ind)
df

     name  age
a  ramesh   30
b  suresh   40
c  satish   50

In [ ]:
# if u want to add the new column 
df['new column']
you need to have a list whoich is having some elemnts
that elements need to equal to number of rows 
city_names=['hyd','blr','chennai']
df['city']=city_names

In [21]:
city_names=['hyd','blr','chennai']
df['city']=city_names
df

     name  age     city
a  ramesh   30      hyd
b  suresh   40      blr
c  satish   50  chennai

### step-6 update the oexisting column

In [ ]:
# if u want to create new column or update the old column 
# both are same way

In [22]:
df['name']=['swamy','asif','sathwik']
df

      name  age     city
a    swamy   30      hyd
b     asif   40      blr
c  sathwik   50  chennai

### step- 7 drop the column

In [ ]:
# in order to drop pthe column 
# we  need to use drop method 
# it takes 3 parameters   
      - drop column or row 
      - mention the coumn name 
    - axis 
    - axis=1 refernce as column 
    - asix =0 refernnce as row 
_ you want to create the new dataframe or 
-you want overwrite the existing dataframe 
-inplace=true

In [23]:
df.drop('city',
       axis=1,
       inplace =True)
df

      name  age
a    swamy   30
b     asif   40
c  sathwik   50

In [40]:
df.drop('c',axis=0,inplace=True)
df

KeyError: "['c'] not found in axis"

#### `step-9 save the data frame

In [41]:
df.to_csv("output.csv")
# while saving index consider as extra column

In [42]:
pd.read_csv('output.csv')

  Unnamed: 0   name  age
0          a  swamy   30
1          b   asif   40

In [49]:
# to avoid that above problem 
# give infdex =false 
df.to_csv('output.csv',index=False)

In [50]:
pd.read_csv('ouput.csv')

  Unnamed: 0   name  age
0          a  swamy   30
1          b   asif   40

### create dataframes using dicitonary

In [ ]:
d1={'name':['ramesh'],'suresh','satish'},
    'age':[30,40,50]}